# U.S. Medical Insurance Costs

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('insurance.csv')

In [3]:
data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [5]:
data.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [7]:
data.region.value_counts(), data.sex.value_counts(), data.smoker.value_counts()

(southeast    364
 southwest    325
 northwest    325
 northeast    324
 Name: region, dtype: int64,
 male      676
 female    662
 Name: sex, dtype: int64,
 no     1064
 yes     274
 Name: smoker, dtype: int64)

In [8]:
data.charges

0       16884.92400
1        1725.55230
2        4449.46200
3       21984.47061
4        3866.85520
           ...
1333    10600.54830
1334     2205.98080
1335     1629.83350
1336     2007.94500
1337    29141.36030
Name: charges, Length: 1338, dtype: float64

In [9]:
dollars = lambda x: round(x, 2)

In [10]:
data['cost'] = data.charges.apply(lambda x: round(x, 2))

In [11]:
data.head()

   age     sex     bmi  children smoker     region      charges      cost
0   19  female  27.900         0    yes  southwest  16884.92400  16884.92
1   18    male  33.770         1     no  southeast   1725.55230   1725.55
2   28    male  33.000         3     no  southeast   4449.46200   4449.46
3   33    male  22.705         0     no  northwest  21984.47061  21984.47
4   32    male  28.880         0     no  northwest   3866.85520   3866.86

In [25]:
b = {'a': 3, 'b': 4, 'c': 5}

In [26]:
b.keys()

dict_keys(['a', 'b', 'c'])

In [27]:
pd.Series(b.keys())

0    a
1    b
2    c
dtype: object

In [29]:
pd.Series(b.values())

0    3
1    4
2    5
dtype: int64

In [31]:
ages = [13,25,19]
series1 = pd.Series(ages,index=['Emma', 'Swetha', 'Serajh'])
print(series1)

Emma      13
Swetha    25
Serajh    19
dtype: int64

In [12]:
print(data)

      age     sex     bmi  children smoker     region      charges      cost
0      19  female  27.900         0    yes  southwest  16884.92400  16884.92
1      18    male  33.770         1     no  southeast   1725.55230   1725.55
2      28    male  33.000         3     no  southeast   4449.46200   4449.46
3      33    male  22.705         0     no  northwest  21984.47061  21984.47
4      32    male  28.880         0     no  northwest   3866.85520   3866.86
...   ...     ...     ...       ...    ...        ...          ...       ...
1333   50    male  30.970         3     no  northwest  10600.54830  10600.55
1334   18  female  31.920         0     no  northeast   2205.98080   2205.98
1335   18  female  36.850         0     no  southeast   1629.83350   1629.83
1336   21  female  25.800         0     no  southwest   2007.94500   2007.94
1337   61  female  29.070         0    yes  northwest  29141.36030  29141.36

[1338 rows x 8 columns]